const mongoose = require('mongoose');
const util = require('util');
const debug = require('debug')('express-mongoose-es6-rest-api:index');

const config = require('../server/config/config');

const PopularPlace = require('../server/models/popularPlace.model');

// connect to mongo db
const mongoUri = config.mongo.host;
mongoose.connect(mongoUri, { keepAlive: 1 });
mongoose.connection.on('error', () => {
  throw new Error(`unable to connect to database: ${mongoUri}`);
});

// const place = [];


const popularplaces = [
  {
    id: 1,
    name: 'ผาชะนะได',
    province: 'อุบลราชธานี',
    description: 'ผาชะนะได เป็นสถานที่ท่องเที่ยวที่ดึงดูดใจด้วยหน้าผาที่ยื่นออกไปรับลมบนที่สูง ปกคลุมด้วยป่าสนสองใบ ทิวทัศน์เบื้องหน้าเป็นทิวเขาสลับซับซ้อน และ ผาชะนะได เป็นจุดที่กรมอุตุนิยมวิทยาใช้คำนวณพยากรณ์ดวงอาทิตย์ขึ้นของประเทศ ด้วยการเห็นลำแสงแรกเริ่มของ ตะวัน ณ เส้นแวงที่ 105 องศา 37 ลิปดา 17 ฟิลิปดา อีกหลายจุดชมวิวทางผ่านไปสู่ของ ผาชะนะได คือ ลานดอกไม้ดิน และการชมพะลานหิน ได้แก่ พะลานหินวัดภูอานนท์ พะลานถ้ำไฮ พะลานภูโลง พะลานผายะยืด พะลานวัดถ้ำอมรถ้ำ ถ้ำปาฏิหาริย์ ถ้ำฝ่ามือแดงบ้านปากลา ผาที่วัดภูอานนท์โหง่นแต้ม เสาเฉลียง และหินโยกมหัศจรรย์ ซึ่งมีน้ำหนักประมาณ 50 ตัน แต่ใช้แรงเพียงคนเดียวโยกได้ หรือจะท่อง ป่าดงนาทาม ซึ่งมีความหลากหลายทางธรรมชาติ เป็นแหล่งเดินป่ายอดนิยมสำหรับนักผจญภัย และตามสูตรที่สูง ทะเลหมอก คือหนึ่งไฮไลท์ของ ผาชะนะได เชื่อกันว่า ใครมีโอกาสเห็นพระอาทิตย์ขึ้นเป็นคนแรก เปรียบเสมือนการเพิ่มพลังให้ชีวิตโชติช่วงดังแสงที่ตัดเส้นขอบฟ้า ช่วงเวลาที่สวยงามที่สุดของการเที่ยว ผาชนะได คือ ปลายฝนต้นหนาว (ปลายตุลาคม-กุมภาพันธ์) เพราะอากาศที่เริ่มเย็นทำให้ดอกไม้นานาชนิดบานสะพรั่ง',
    img1: 'http://travel.mthai.com/app/uploads/2012/10/phachanadai1.jpg',
    img2: 'http://travel.mthai.com/app/uploads/2012/10/phachanadai5.jpg',
    img3: 'https://travel.mthai.com/app/uploads/2012/10/phachanadai3.jpg',
  },
  {
    id: 2,
    name: 'เชียงคาน',
    province: 'เลย',
    description: 'เชียงคาน เมืองเล็กๆ ริมแม่น้ำโขงสุดชายแดนไทย เป็นอำเภอหนึ่งในจังหวัดเลย ที่คงยังคงไว้ซึ่งวัฒนธรรม ขนบประเพณี การใช้ชีวิตแบบเรียบง่าย พอเพียง วิถีชีวิตแบบดั้งเดิม ซึ่งหาดูยากในปัจจุบัน เมืองเล็กๆ ที่เงียบสงบ แห่งนี้ กำลังเป็นที่สนใจ ของนักท่องเที่ยวจำนวนมาก  ภาพบ้านเก่าๆที่เรียงรายติดกันอยู่ริมถนนชายโขง ดึงดูดใจ ให้นักท่องเที่ยวหลายต่อหลายรุ่นต่าง หลั่งไหลเดินทางกันมาที่นี่ บ้านเรือนที่เมืองเชียงคานจะแบ่งออกเป็นซอย เล็กๆ เรียกว่า ถนนศรีเชียงคาน ขนานคู่กันไปไปกับถนนใหญ่ ซึ่งเป็นถนนสายหลัก เริ่มตั้งแต่ถนนศรีเชียงคาน ซอยที่ 1- 24  แบ่งเป็นถนนศรีเชียงคานฝั่งบนกับฝั่งล่างซึ่งชื่อซอยเหมือนกัน ถนนศรีเชียงคานฝั่งล่าง คือ ถนนเส้นที่เต็มไปด้วยบ้านไม้เก่าแก่ ที่พัก โฮมสเตย์ ร้านอาหาร และร้านค้าเก๋ มากมายซึ่งถนนในเส้นนี้ จะเรียกว่า "ถนนชายโขง" ซึ่ง ระยะทางกว่า  2 กิโลเมตร  เป็นเส้นทางที่นักท่องเที่ยว นิยมมาปั่นจักรยานชมบรรยากาศ ถ่ายรูปเล่น ชมบ้านไม้สมัยเก่า แต่ก็มีบางส่วนเป็นตึกแถวสร้างใหม่ ซึ่งทาง เทศบาลไม่อนุญาตให้ปลูกสร้าง เพราะต้องการอนุรักษ์ สภาพแวดล้อม บริเวณถนนสายนี้ให้เป็นบ้านไม้ทั้งหมดเป็นการรักษาวัฒนธรรมดั้งเดิมของชาวเชียงคาน แต่ถึงแม้บ้านไม้เก่าๆ ถึงแม้ถูกดัดแปลง ให้เป็นร้านขายของ ร้านอาหาร ร้านกาแฟ บ้านพักโฮมสเตย์ไปแล้วส่วนหนึ่ง แต่ถึงอย่างไรความ สงบเรียบง่ายของวิถีชีวิต รอยยิ้มที่ แสนจะจริง ของผู้คนในเมืองนี้ ยังคงเป็นเสน่ห์ที่ทำให้เมืองเชียงคานแตกต่างจากเมืองท่องเที่ยวอื่นๆ ',
    img1: 'https://www.paiduaykan.com/76_province/Northeast/loie/pic/chaingkhan1.jpg',
    img2: 'https://www.paiduaykan.com/76_province/Northeast/loie/pic/chaingkhan2.jpg',
    img3: 'https://www.paiduaykan.com/76_province/Northeast/loie/pic/chaingkhan6.jpg',
  },
  {
    id: 3,
    name: ' ทะเลบัวแดง',
    province: 'อุดรธานี',
    description: 'ทะเลบัวแดง บึงหนองหานกุมภวาปี ชมทุ่งดอกไม้ตามธรรมชาติที่ใหญ่ที่สุดในประเทศไทย ความอุดมสมบูรณ์ที่ควรค่าแก่การศึกษา .. เราๆ ท่านๆ คงเคยได้ยินชื่อของ “หนองหาน” กันมานานนม แต่ก็มีจำนวนไม่น้อยที่สับสนหรือยังไม่รู้ว่าในภาคอีสานของเรานี้ ก็มีทั้ง “หนองหาน” สถานที่สำคัญประจำ อ.กุมภวาปี จ.อุดรธานี และ “หนองหาร” หนองน้ำใหญ่ที่มีตำนานผาแดงนางไอ่ และความเชื่อเรื่องพญานาค ใน จ.สกลนคร ที่ยังคงเล่าขานต่อเนื่องกันมา จนถึงทุกวันนี้ หนองหาน ที่เราจะพาไปเที่ยวคราวนี้ คือ ทะเลสาบน้ำจืดขนาดใหญ่ที่กินพื้นที่ส่วนใหญ่อยู่ใน อ.กุมภวาปี กับบางส่วนในพื้นที่ อ.ประจักษ์ศิลปาคมของ จ.อุดรธานี ความอุดมสมบูรณ์ของบึงหนองหานถือเป็นต้นแบบที่น่าสนใจต่อการศึกษาระบบ นิเวศน์วิทยา เพราะที่นี่ชัดเจนความสัมพันธ์ระหว่างพืชพรรณและสัตว์ กลับคืนมาเป็นผลิตผลให้ชาวบ้านได้เก็บเกี่ยวเลี้ยงชีพและหล่อเลี้ยงชุมชนจน เป็นภาพวิถีชีวิตของชาวหนองหานมานานปี กาลเวลาผ่านไปวิถีชาวบ้านกลายเป็นความงดงามตามธรรมชาติในยุคที่ผู้คนโหยหา สิ่งที่เลือนหาย ในขณะที่ความอุดมสมบูรณ์ของบึงหนองหานยังคงอยู่ วงจรชีวิตของ บัวแดง หรือ “บัวสาย” ที่บึงหนองหานจึงเป็นประจักษ์พยานถึงความอุดมสมบูรณ์ที่ควรค่าแก่การศึกษา นั่นจึงเป็นเหตุผลที่ว่าทำไมบัวแดงที่บึงหนองหานจึงงอกงามทั่วท้องน้ำไปไกล สุดลูกหูลูกตานับเป็นหมื่นๆ ไร่ (นี่ยังไม่ถึงครึ่งของบึงเลยด้วยซ้ำ) เพื่อที่การชม ทุ่งทะเลบัวแดง แหล่งชมทุ่งดอกไม้ตามธรรมชาติที่ใหญ่ที่สุดในประเทศไทย จะได้เต็มอิ่มและเพลิดเพลินกว่าการนั่งเรือชมความงามอย่างเดียว เรามาสัมผัส ทะเลบัวแดง หนองหานภุมภวาปี ตามคำบอกเล่าของคนที่มาก่อนเรา และหอบความประทับใจกลับไปบอกต่อ และด้วยความที่ได้รับการโปรโมทจากททท.ให้เป็นแหล่งท่องเที่ยวอันซีนแหล่ง ใหม่เริ่มจะคุ้นเคยในหมู่นักท่องเที่ยว ด้วยความงามอันเป็นเอกลักษณ์ของดอกบัวที่ธรรมชาติรังสรรค์ เมื่อสีแดงอมชมพูของดอกบัวเบ่งบานขึ้นพร้อมๆ กัน ก็จะกลายเป็นภาพความงามอันวิจิตรสุดลูกลูกตาราวกับเนรมิตบนผืนผ้าใบ ขณะที่บรรยากาศโดยรอบบึงหนองหาน ก็สะท้อนความอุดมสมบูรณ์ของแหล่งน้ำตาม ธรรมชาติด้วยพันธุ์ปลาน้ำจืด สายพันธุ์นกท้องถิ่น และพืชน้ำอีกจำนวนมากอันเป็นหัวใจของระบบนิเวศน์ที่หล่อเลี้ยง ทะเลบัวแดง และวิถีชุมชนให้ยั่งยืนจนถึงทุกวันนี้ หากเราเป็นคนต่างถิ่นที่หลงเข้าไปใน อำเภอกุมภวาปี ช่วงราวๆ กลางเดือน – ปลายเดือนธันวาคม ของทุกปี เราอาจพบเห็นชาวบ้านกลุ่มใหญ่ของ ต.บ้านเดียม มาออกันอยู่เนืองแน่นบึงหนองหาน ก็เพราะในช่วงนี้ของทุกปีจะเป็นช่วงใกล้เวลาที่บึงหนองหานจะเปิดบ้านต้อนรับ นักท่องเที่ยวที่หลั่งใหลกันมาล่องเรือชม “ทะเลบัวแดง” ชาวบ้านเขาจึงเตรียมความพร้อมบึงหนองหานด้วยการร่วมแรงร่วมใจระดมเก็บ สาหร่ายกลางพื้นที่นับหมื่นไร่ เพื่อให้ดอกบัวแดงโผล่พ้นน้ำเบ่งบานงดงามอวดนักท่องเที่ยวอย่างเต็มที่ใน ช่วงปีใหม่ไปจนถึงเดือนกุมภาพันธ์นั่นเอง',
    img1: 'https://travel.mthai.com/app/uploads/2013/09/I-San-Photo-Contest-2012_consolation-prize_01-B.jpg',
    img2: 'https://travel.mthai.com/app/uploads/2013/09/11.jpg',
    img3: 'https://travel.mthai.com/app/uploads/2013/09/%E0%B8%97%E0%B8%B0%E0%B9%80%E0%B8%A5%E0%B8%9A%E0%B8%B1%E0%B8%A7%E0%B9%81%E0%B8%94%E0%B8%87-%E0%B8%AB%E0%B8%99%E0%B8%AD%E0%B8%87%E0%B8%AB%E0%B8%B2%E0%B8%99-%E0%B8%81%E0%B8%B8%E0%B8%A1%E0%B8%A0%E0%B8%A7%E0%B8%B2%E0%B8%9B%E0%B8%B5-%E0%B8%88%E0%B8%B1%E0%B8%87%E0%B8%AB%E0%B8%A7%E0%B8%B1%E0%B8%94%E0%B8%AD%E0%B8%B8%E0%B8%94%E0%B8%A3%E0%B8%98%E0%B8%B2%E0%B8%99%E0%B8%B5-1.jpg',
  },
  {
    id: 4,
    name: 'วัดพระธาตุหนองแวง',
    province: 'ขอนแก่น',
    description: 'วัดพระธาตุหนองแวง ตั้งอยู่ที่ถนนกลางเมือง ริมบึงแก่นนคร อำเภอเมือง ภายในวัดหนองแวงเมืองเก่าซึ่งเป็นพระอารามหลวงมีพระมหาธาตุแก่นนครหรือ พระธาตุเก้าชั้นฐานสี่เหลี่ยมกว้างด้านละ 50 เมตร เรือนยอดทรงเจดีย์จำลองแบบจากพระธาตุขามแก่น จัดสร้างขึ้น เนื่องในวโรกาสที่ พระบาทสมเด็จ พระปรมินทรมหาภูมิพลอดลยเดชทรงครองสิริราชสมบัติครบ 50 ปี และมหามังคลานุสรณ์ 200 ปี เมืองขอนแก่น ความสูงขององค์พระธาตุฯ 80 เมตร มีพระจุลธาตุ 4 องค์ ตั้งอยู่ 4 มุมและมีกำแพงแก้วพญานาค 7 เศียรล้อมรอบ เป็นศิลปะสมัยทวาราวดี ผสมผสานศิลปะอินโดจีน ซึ่งเป็นลักษณะแบบชาวอีสาน ตากแห วัดพระธาตุหนองแวงเปิดให้เข้าชมทุกวัน ตั้งแต่เวลา 08.00 – 18.00 น.',
    img1: 'https://www.paiduaykan.com/province/Northeast/khonkaen/pic/pratadnongwang.jpg',
    img2: 'https://www.paiduaykan.com/province/Northeast/khonkaen/pic/pratadnongwang9.jpg',
    img3: 'https://www.paiduaykan.com/province/Northeast/khonkaen/pic/pratadnongwang10.jpg',
  },
  {
    id: 5,
    name: 'สะพานมิตรภาพไทย-ลาว 3',
    province: 'นครพนม',
    description: 'สะพานมิตรภาพไทย-ลาว 3 เป็นสะพานที่เชื่อมต่อระหว่างประเทศไทย (นครพนม) กับประเทศลาว(คำม่วน) พื้นที่ฝั่งไทยที่บ้านห้อม ตำบลอาจสามารถ อำเภอเมืองนครพนม จังหวัดนครพนมฝั่งลาวอยู่ที่บ้านเวินใต้ เมืองท่าแขก แขวงคำม่วน เป็นสะพานที่มีความ สวยงาม มากอีกแห่งหนึ่งในประเทศไทย มีวิวข้างหลังเป็นภาพภูเขาหินปูนของประเทศไทยลาวลูกน้อยใหญ่ที่เรียงรายสลับซับซ้อน  บริเวณด้านล่างสะพานมีจุดชมวิวที่สามารถมองเห็นสะพานได้จากข้างล่าง ตั้งอยู่ริมฝั่งโขงสามารถมาเดินเล่นพักผ่อนรับลมเย็น ที่พัดมาจากฝั่งลาว',
    img1: 'https://www.paiduaykan.com/province/Northeast/nakhonphanom/pic/thailaosbridge1.jpg',
    img2: 'https://www.paiduaykan.com/province/Northeast/nakhonphanom/pic/thailaosbridge7.jpg',
    img3: 'https://www.paiduaykan.com/province/Northeast/nakhonphanom/pic/thailaosbridge6.jpg',
  },
  {
    id: 6,
    name: 'ภูทอก',
    province: 'บึงกาฬ',
    description: `"ภูทอก เป็นที่ตั้งของวัดเจติยาศรีวิหาร (วัดภูทอก) อยู่ในอาณาเขตบ้านคำแคน ตำบลนาสะแบง จ.บึงกาฬ โดยมีพระอาจารย์จวน กุลเชฏโฐ เป็นผู้ก่อตั้ง ในภาษาอีสานแปลว่า ภูเขาที่โดดเดี่ยว ภูทอก มี 2 ลูก คือภูทอกใหญ่และภูทอกน้อยส่วนที่นักแสวงบุญและ นักท่องเที่ยวทั่วไป สามารถชมได้คือ ภูทอกน้อย ส่วนภูทอกใหญ่อยู่ห่างออกไป ยังไม่เปิดให้นักท่องเที่ยวชม ซึ่งเป็นจุดเริ่มต้นการ เดินเท้าขึ้นสู่ยอดภูทอก จุดเด่นของภูทอกก็คือ สะพานไม้และบันไดขึ้นชมทัศนียภาพรอบ ๆ ภูทอก ใช้เพียงแรงงานคนสร้างบันได เวียนไปมา รอบภูทอกแบบ 360 ซึ่งมีทั้งหมด 7 ชั้น ใช้เวลาในการก่อสร้างนานถึง 5 ปีเต็มจากชั้น 1-7 จะมีบันไดไม้ให้เดินแบบ ตรงทอดยาวจนถึงจุดสูงสุดของยอดภูทอก และตั้งแต่ชั้นที่ 3 เป็นต้นไปนักท่องเที่ยวสามารถเดินชม แบบสะพานเวียนรอบเขาซึ่งจะ ได้เห็น มุมมองที่แตกต่างไปเรื่อย ๆ บันไดที่ทอดขึ้นสู่ยอดภูทอกนี้เปรียบเสมือนเส้นทางธรรมที่น้อมนำ สัตบุรุษ ให้พ้นโลกแห่งโลกียะ สู่โลกแห่ง โลกุตระหรือโลกแห่ง การหลุดพ้นด้วย ความเพียรพยายามและมุ่งมั่น ภูทอก ปิดไม่ให้นักท่องเที่ยว ขึ้นในวันที่ 10 -16  เมษายน ของทุกปี   ภูทอกแบ่งออกเป็น 7 ชั้น แตกต่างกันดังนี้
    ชั้นที่ 1-2 เป็นบันไดสู่ ชั้นที่ 3 ซึ่งเริ่มเป็นสะพานเวียนรอบเขา สภาพเป็นป่าเขามืดครึ้ม มีโขดหินลานหิน สุดทางชั้นที่ 3 มีทางแยก สองทาง ทางซ้ายมือ เป็นทางลัดไปสู่ชั้นที่ 5 ได้เลย ซึ่งเป็นทางชันมาก ผ่านซอกหินที่มีลักษณะเหมือนอุโมงค์ ทางขวามือ เป็นทางขึ้นสู่ชั้นที่ 4
    ชั้นที่ 4 เป็นสะพานลอยไต่เวียนรอบเขา มองไปเบื้องล่างจะเห็นเนินเขาเตี้ยๆ สลับกัน เรียกว่า ""ดงชมพู"" ทิศตะวันออกจดกับภูลังกา เขตอำเภอเซกา ซึ่งมีสภาพเป็นป่าดิบ มีแม่น้ำลำธารหลายสายไหลผ่าน มีสัตว์ป่ามากมายอาศัยอยู่ โดยเฉพาะมีฝูงกา มาอาศัย อยู่มาก จึงเรียกกันว่า ""ภูรังกา"" แล้วเพี้ยนมาเป็น ""ภูลังกา"" ในที่สุด ส่วนบนชั้นที่ 4 นี้ จะเป็นที่พักของแม่ชีรอบชั้นมีระยะทาง ประมาณ 400 เมตร มีที่พักผ่อนระหว่างทางเป็นระยะ ๆ
    ชั้นที่ 5 หรือชั้นกลาง ถือว่าเป็นชั้นที่สำคัญที่สุด จะมีศาลาขนาดใหญ่ พระพุทธรูป กุฏิพระ และเป็นที่เก็บสังขารของพระอาจารย์ จวนด้วย พื้นที่สะอาดกว้างขวาง ดูแล้วร่มเย็นมาก เหมาะสำหรับการนั่งสวดมนต์ปฏิบัติธรรมสำหรับนักแสวงบุญหรือผู้ที่ใฝ่หาความ สงบ ตลอดตามช่องทางเดินจะมีถ้ำอยู่หลายจุด เช่น ถ้ำเหล็กไหล ถ้ำแก้ว ถ้ำฤาษี ฯลฯ มีที่ให้นั่งพักสำหรับความอ่อนล้า ระหว่างทาง เดิน เป็นระยะ ถ้าเดินมาทางด้านเหนือจะเห็นสะพานหินธรรมชาติทอดสู่พุทธวิหารอันเป็นที่บรรจุพระบรมสารีริกธาตุ มีลักษณะแปลก และน่าอัศจรรย์ที่สุดคล้าย ๆ กับพระธาตุอินทร์แขวนที่พม่า คือ เป็นหินแยกตัวออกมาจากหินก้อนใหญ่ แต่ไม่ตกลงมา เพราะตั้งอยู่อย่าง ได้ฉากกับพื้นโลกพอดี ปัจจุบันมีสะพานไม้เชื่อมต่อระหว่างสะพานหินกับพุทธวิหาร มองออกไปจะเห็นแนวของภูทอกใหญ่อย่าง ชัดเจน และมีบันไดเวียนขึ้นสู่ชั้นที่ 6 ซึ่งเป็นชั้นสุดท้ายของบันไดเวียนรอบเขา
    ชั้นที่ 6 จะเป็นจุดชมวิวิที่สวยที่สุด ตลอดทางเดินจะเป็นหน้าผายื่นออกมาทำให้ในบางครั้งเวลาเดินต้องเบี่ยงตัวออกมาเล็กน้อย โดยแต่ละจุดก็จะมีชื่อของหน้าผาที่แตกต่างกัน เช่น ผาเทพนิมิตร ผาหัวช้าง ผาเทพสถิต เป็นต้น ในช่วงฤดูหนาวจะ มีทะเลหมอก ลอยอยู่รอบ ๆ ยอดเขา ทำให้เหมือนอยู่บนสวรรค์ จากชั้นที่ 6 สู่ชั้นที่ 7 เป็นสะพานไม้เวียนรอบเขายาว 400 เมตร เกาะติดอยู่ริม หน้าผา สูงชันดูน่าหวาดเสียวอันตราย มีความยาว 400 เมตร สำหรับสิ่งศักดิ์สิทธิ์และน่าชมที่สุดของชั้นนี้คือ ปากทางเข้าเมืองพญานาค ซึ่งอยู่หลังพระปางนาคปรก มีจุดให้สังเกตคือ มีรอยสีขาวขูดติดกับหินปูน ซึ่งชาวบ้านถือว่าเป็นรอยถลอกที่เกิดจากท้องพญานาค สัมผัส กับหิน และมีบ่อน้ำเล็ก ๆ มีน้ำขังอยู่เกือบตลอดปี
    ชั้นที่ 7 จะมีบันไดไม้พาดขึ้นมา เมื่อเดินขึ้นบันไดผ่านมาแล้วจะเจอทางแยก 2 ทางเพื่อขึ้นไปบนดาดฟ้าชั้น 7 ทางแรกเป็นทางชัน ต้องเกาะ เกี่ยวกิ่งไม้และรากไม้เดินลำบาก แถมยังมีป้ายบอกให้ ""ระวังงู"" ซึ่งเป็นสัตว์ที่มีอยู่มากบนยอดภูแห่งนี้ด้วย ควรใช้อีกทาง หนึ่งซึ่งเป็น ทางอ้อมต้อง เดินเวียนไปทางขวามือ แต่ก็จะมาบรรจบกันด้านบนชั้น 7 หรือดาดฟ้า ซึ่งเป็นพื้นที่ป่าไม่ทึบธรรมดา มีเนื้อที่ประมาณ 5 ไร่"`,
    img1: 'https://www.paiduaykan.com/province/Northeast/bungkan/pic/phutok23.jpg',
    img2: 'https://www.paiduaykan.com/province/Northeast/bungkan/pic/phutok8.jpg',
    img3: 'https://www.paiduaykan.com/province/Northeast/bungkan/pic/phutok27.jpg',
  },
  {
    id: 7,
    name: 'วัดภูมโนรมย์',
    province: 'มุกดาหาร',
    description: 'ผาชะนะได เป็นสถานที่ท่องเที่ยวที่ดึงดูดใจด้วยหน้าผาที่ยื่นออกไปรับลมบนที่สูง ปกคลุมด้วยป่าสนสองใบ ทิวทัศน์เบื้องหน้าเป็นทิวเขาสลับซับซ้อน และ ผาชะนะได เป็นจุดที่กรมอุตุนิยมวิทยาใช้คำนวณพยากรณ์ดวงอาทิตย์ขึ้นของประเทศ ด้วยการเห็นลำแสงแรกเริ่มของ ตะวัน ณ เส้นแวงที่ 105 องศา 37 ลิปดา 17 ฟิลิปดา อีกหลายจุดชมวิวทางผ่านไปสู่ของ ผาชะนะได คือ ลานดอกไม้ดิน และการชมพะลานหิน ได้แก่ พะลานหินวัดภูอานนท์ พะลานถ้ำไฮ พะลานภูโลง พะลานผายะยืด พะลานวัดถ้ำอมรถ้ำ ถ้ำปาฏิหาริย์ ถ้ำฝ่ามือแดงบ้านปากลา ผาที่วัดภูอานนท์โหง่นแต้ม เสาเฉลียง และหินโยกมหัศจรรย์ ซึ่งมีน้ำหนักประมาณ 50 ตัน แต่ใช้แรงเพียงคนเดียวโยกได้ หรือจะท่อง ป่าดงนาทาม ซึ่งมีความหลากหลายทางธรรมชาติ เป็นแหล่งเดินป่ายอดนิยมสำหรับนักผจญภัย และตามสูตรที่สูง ทะเลหมอก คือหนึ่งไฮไลท์ของ ผาชะนะได เชื่อกันว่า ใครมีโอกาสเห็นพระอาทิตย์ขึ้นเป็นคนแรก เปรียบเสมือนการเพิ่มพลังให้ชีวิตโชติช่วงดังแสงที่ตัดเส้นขอบฟ้า ช่วงเวลาที่สวยงามที่สุดของการเที่ยว ผาชนะได คือ ปลายฝนต้นหนาว (ปลายตุลาคม-กุมภาพันธ์) เพราะอากาศที่เริ่มเย็นทำให้ดอกไม้นานาชนิดบานสะพรั่ง',
    img1: 'http://travel.mthai.com/app/uploads/2012/10/phachanadai1.jpg',
    img2: 'http://travel.mthai.com/app/uploads/2012/10/phachanadai5.jpg',
    img3: 'https://travel.mthai.com/app/uploads/2012/10/phachanadai3.jpg',
  },
  {
    id: 8,
    name: 'พิพิธภัณฑ์พญาคันคาก',
    province: 'ยโสธร',
    description: 'วัดภูมโนรมย์ หรือ วัดรอยพระพุทธบาทภูมโนรมย์ ตั้งอยู่ในอำเภอเมืองมุกดาหาร ห่างจากตัวเมืองประมาณ 5 กิโลเมตร เป็นสถานที่สวยงามอีกแห่งหนึ่งตั้งอยู่บนยอดเขา ที่สามารมองเห็นทิวทัศน์ของจังหวัดมุกดาหาร แม่น้ำโขง และแขวงสะหวันนะเขต สปป.ลาว ภายในวัด มีรูปปั้นพญานาคขนาดใหญ่สวยงามอลังการ เป็นอีกหนึ่งแลนด์มาร์คใหม่ของมุกดาหาร  นอกจากนี้ภายในบริเวณวัดมีรอยพระพุทธบาทจำลอง พระเจ้าใหญ่แก้วมุกดาศรีไตรรัตน์ ให้ได้สักการะขอพรอีกด้วย',
    img1: 'https://www.paiduaykan.com/travel/wp-content/uploads/2019/12/1-SON06932-800x533.jpg',
    img2: 'https://www.paiduaykan.com/travel/wp-content/uploads/2019/12/4-SON06926-800x533.jpg',
    img3: 'https://www.paiduaykan.com/travel/wp-content/uploads/2019/12/9-DEW_6571-800x533.jpg',
  },
  {
    id: 9,
    name: 'พระเจดีย์มิ่งมงคล',
    province: 'ร้อยเอ็ด',
    description: 'มหาเจดีย์ขนาดใหญ่ที่วิจิตรพิสดาร ใช้ศิลปกรรมร่วมสมัยระหว่างภาคกลางและภาคอีสานเป็นการผสมกันระหว่างพระปฐมเจดีย์และพระธาตุพนม ใช้งบประมาณก่อสร้างถึงปัจจุบันกว่า 3,000 ล้านบาท ดำเนินการสร้างโดย “พระอาจารย์ศรี มหาวิโร” ซึ่งเป็นศิษย์พระอาจารย์มั่น ภูริทัตโต พระมหาเจดีย์ชัยมงคล ออกแบบโดยกรมศิลปากรเป็นสีขาวตกแต่งลวดลาย ตระการตาด้วย สีทองเหลืองอร่าม รายล้อมด้วยเจดีย์องค์เล็กทั้ง 8 ทิศ รวมยอดทองคำ ภายในองค์พระมหาเจดีย์เหมือนอยู่บนวิมานแดนสวรรค์',
    img1: 'https://paiduaykan.com/province/Northeast/roiet/pic/prajadeechaimongkol2.jpg',
    img2: 'http://travel.mthai.com/app/uploads/2012/10/phachanadai5.jpg',
    img3: 'https://travel.mthai.com/app/uploads/2012/10/phachanadai3.jpg',
  },
  {
    id: 10,
    name: 'ผามออีแดง',
    province: 'ศรีสะเกษ',
    description: 'ผาชะนะได เป็นสถานที่ท่องเที่ยวที่ดึงดูดใจด้วยหน้าผาที่ยื่นออกไปรับลมบนที่สูง ปกคลุมด้วยป่าสนสองใบ ทิวทัศน์เบื้องหน้าเป็นทิวเขาสลับซับซ้อน และ ผาชะนะได เป็นจุดที่กรมอุตุนิยมวิทยาใช้คำนวณพยากรณ์ดวงอาทิตย์ขึ้นของประเทศ ด้วยการเห็นลำแสงแรกเริ่มของ ตะวัน ณ เส้นแวงที่ 105 องศา 37 ลิปดา 17 ฟิลิปดา อีกหลายจุดชมวิวทางผ่านไปสู่ของ ผาชะนะได คือ ลานดอกไม้ดิน และการชมพะลานหิน ได้แก่ พะลานหินวัดภูอานนท์ พะลานถ้ำไฮ พะลานภูโลง พะลานผายะยืด พะลานวัดถ้ำอมรถ้ำ ถ้ำปาฏิหาริย์ ถ้ำฝ่ามือแดงบ้านปากลา ผาที่วัดภูอานนท์โหง่นแต้ม เสาเฉลียง และหินโยกมหัศจรรย์ ซึ่งมีน้ำหนักประมาณ 50 ตัน แต่ใช้แรงเพียงคนเดียวโยกได้ หรือจะท่อง ป่าดงนาทาม ซึ่งมีความหลากหลายทางธรรมชาติ เป็นแหล่งเดินป่ายอดนิยมสำหรับนักผจญภัย และตามสูตรที่สูง ทะเลหมอก คือหนึ่งไฮไลท์ของ ผาชะนะได เชื่อกันว่า ใครมีโอกาสเห็นพระอาทิตย์ขึ้นเป็นคนแรก เปรียบเสมือนการเพิ่มพลังให้ชีวิตโชติช่วงดังแสงที่ตัดเส้นขอบฟ้า ช่วงเวลาที่สวยงามที่สุดของการเที่ยว ผาชนะได คือ ปลายฝนต้นหนาว (ปลายตุลาคม-กุมภาพันธ์) เพราะอากาศที่เริ่มเย็นทำให้ดอกไม้นานาชนิดบานสะพรั่ง',
    img1: 'https://www.paiduaykan.com/travel/wp-content/uploads/2019/10/1-DEW_6335-800x533.jpg',
    img2: 'https://www.dmc.tv/images/00-iimage/Mahajedichaimongkol_02.jpg',
    img3: 'https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcQ3nFNWQ5kLgo2yr8TgQrd0SbOyzhAXT_C-6A&usqp=CAU',
  },
  {
    id: 11,
    name: 'ถ้ำผาเจาะ',
    province: 'หนองบัวลำภู',
    description: 'ถ้ำผาเจาะ ตั้งอยู่ในอำเภอนาวง เป็นสถานที่ท่องเที่ยวน่าสนใจ ที่ถือได้ว่าเป็นแหล่งเที่ยวแห่งใหม่สุด Unseen ของหนองบัวลำภู ถ้ำผาเจาะ เป็นถ้ำในภูเขาหินแกรนิตที่มีเอกลักษณ์โดดเด่นมีลักษณะเหมือนถูกเจาะหน้าผาแต่เกิดขึ้นเองตามธรรมชาติ ปากถ้ำมองเห็นแต่ไกลมีความงดงามเป็นอย่างมาก  ไฮไลท์ของการมาเที่ยวถ้ำผาเจาะ คือ การขึ้นไปยังจุดชมวิวสุงสุด ที่โอบล้อมด้วยภูเขาและธรรมชาติที่ยังคงอุดมสมบูรณ์ เมื่อมองลงมาข้างล่างเห็นวิวทิวทัศน์บริเวณบ้านผาเจาะและอำเภอนาวังได้ทั้งหมด รวมทั้งมองเห็นวิวทุ่งนาเขียวขจีสุดสายตา บนยอดถ้ำผาเจาะยังมีองค์พระองค์ใหญ่ประดิษฐานอยู่ข้างบน เพื่อให้ผู้คนได้กราบไหว้บูชาอีกด้วย',
    img1: 'https://www.paiduaykan.com/travel/wp-content/uploads/2018/10/%E0%B8%9B%E0%B8%81%E0%B8%96%E0%B9%89%E0%B8%B3%E0%B8%9C%E0%B8%B2%E0%B9%80%E0%B8%88%E0%B8%B2%E0%B8%B0-800x534.jpg',
    img2: 'https://www.paiduaykan.com/travel/wp-content/uploads/2018/10/5-DEW_2331-800x533.jpg',
    img3: 'https://www.paiduaykan.com/travel/wp-content/uploads/2018/10/3-DEW_2327-800x533.jpg',
  },
  {
    id: 12,
    name: 'วัดผาตากเสื้อ',
    province: 'หนองคาย',
    description: 'วัดผาตากเสื้อ ตั้งอยู่ในเขตอำเภอสังคม จังหวัดหนองคาย เป็นวัดที่ตั้งอยู่บนยอดเขาสูง วัดแห่งนี้ไม่ได้เป็นแต่สถานที่ปฏิบัติธรรมเท่านั้น แต่ยังเป็นแหล่งท่องเที่ยวที่มีความงดงามตามธรรมชาติ มีนักท่องเที่ยวเดินทางมาชมความงามอย่างไม่ขาดสาย ภายในวัดมองเห็นวิวของแม่น้ำโขงที่สวยที่สุดแห่งหนึ่ง โดยได้จัดทำ Skywalk ริมหน้าผาเป็นทางเดินกระจกใสรูปวงกลมสำหรับชมวิว หากมาเที่ยวในช่วงเช้าอาจมีโอกาสได้เห็นสายหมอกบางที่ลอยเหนือแม่น้ำโขงอีกด้วย ทางไปวัดผาตากเสื้อ จะต้องขับรถขึ้นเขาแต่ไม่ชันมาก เป็นถนนราดยางตลอดสายขับง่ายๆสบายๆ ระหว่างทางจะมองเห็นลำน้ำโขง และต้นไม้มากมาย เมื่อมาถึงตัววัดมีลานจอดรถสะดวกสบาย  ภายในวัดบรรยากาศร่มรื่น เงียบสงบ มีจุดไหว้พระอยู่ด้านหน้าทางเข้า 1 จุด และ เดินขึ้นไปด้านบนจะเป็นโบสถ์อีก 1 จุด ซึ่งด้านหน้ามีบันไดพญานาคทอดยาวไปจนถึงตัวโบสถ์ ภายในประดิษฐานองค์พระประธานของวัด ส่วนไฮไลท์ที่นักท่องเที่ยวสนใจ คือ  Skywalk มองเห็นแม่น้ำโขงกั้นอยู่เบื้องล่างกั้นระหว่างประเทศไทยและลาว เป็นพื้นกระจกที่ยื่นออกมาจากหน้าผา ให้นักท่องเที่ยวได้เดินออกไปสัมผัสกับบรรยากาศบนกระจกใสแบบตื่นเต้น โดยเฉพาะในเวลาเช้าอาจมีโอกาสได้เห็นสายหมอกลอยคลอเคลียอยู่เหนือน้ำโขง นอกจากสกายวอล์คแล้ว วัดผาตากเสื้อยังมีอีกจุดชมวิวอีกหนึ่งจุดตั้งอยู่ใกล้กัน เป็นชะง่อนผายื่นออกไป ให้นักท่องเที่ยวได้เก็บภาพมุมสูงที่มีภาพเบื้องหลังเป็นแม่น้ำโขงและธรรมชาติโดยรอบของทั้งสองฝั่ง',
    img1: 'https://www.paiduaykan.com/travel/wp-content/uploads/2020/01/1-SON08841-800x533.jpg',
    img2: 'https://www.paiduaykan.com/travel/wp-content/uploads/2020/01/2-SON08896-800x533.jpg',
    img3: 'https://www.paiduaykan.com/travel/wp-content/uploads/2020/01/8-SON08901-800x533.jpg',
  }
];

PopularPlace.insertMany(popularplaces, (error, docs) => {
  if (error) {
    console.error(error);
  } else {
    console.log(docs);
  }
  mongoose.connection.close();
});

// PopularPlace.deleteMany({}, (error, docs) => {
//   if (error) {
//     console.error(error);
//   } else {
//     console.log(docs);
//   }
//   mongoose.connection.close();
// });
